benjaminjnoack/GREQ/board/pin_mux.h
/*! @name EXTAL32 (coord M6), Y3[2]
  @{ */
/* @} */

/*! @name XTAL32 (coord M7), Y3[1]
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCs(void);

/*! @name PORTC3 (coord A11), J1[2]/UART1_RX/FTM0_CH2/CLKOUT
  @{ */
#define MSGEQ7_Reset_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define MSGEQ7_Reset_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MSGEQ7_Reset_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                /* @} */

/*! @name PORTC4 (coord A9), J1[4]/UART1_TX/FTM0_CH3/FB_AD11
  @{ */
#define MSGEQ7_Strobe_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define MSGEQ7_Strobe_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MSGEQ7_Strobe_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                 /* @} */

/*! @name PORTC2 (coord A12), J1[14]/FTM0_CH1/CMP1_IN0/FB_AD12
  @{ */
#define MSGEQ7_Out_PORT PORTC /*!<@brief PORT device name: PORTC */
#define MSGEQ7_Out_PIN 2U     /*!<@brief PORTC pin index: 2 */
                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MSGEQ7(void);

/*! @name PORTB4 (coord G10), J4[8]/ADC1_SE10
  @{ */
#define POTENTIOMETER_ADC1_SE10_PORT PORTB /*!<@brief PORT device name: PORTB */
#define POTENTIOMETER_ADC1_SE10_PIN 4U     /*!<@brief PORTB pin index: 4 */
                                           /* @} */

/*! @name PORTB5 (coord G9), J4[6]/ADC1_SE11
  @{ */
#define POTENTIOMETER_ADC1_SE11_PORT PORTB /*!<@brief PORT device name: PORTB */
#define POTENTIOMETER_ADC1_SE11_PIN 5U     /*!<@brief PORTB pin index: 5 */
                                           /* @} */

/*! @name PORTB6 (coord F12), J4[4]/ADC1_SE12
  @{ */
#define POTENTIOMETER_ADC1_SE12_PORT PORTB /*!<@brief PORT device name: PORTB */
#define POTENTIOMETER_ADC1_SE12_PIN 6U     /*!<@brief PORTB pin index: 6 */
                                           /* @} */

/*! @name PORTB7 (coord F11), J4[2]/ADC1_SE13
  @{ */
#define POTENTIOMETER_ADC1_SE13_PORT PORTB /*!<@brief PORT device name: PORTB */
#define POTENTIOMETER_ADC1_SE13_PIN 7U     /*!<@brief PORTB pin index: 7 */
                                           /* @} */

/*! @name ADC1_SE16 (coord K3), J4[7]/ADC1
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void POTENTIOMETER(void);

/*! @name PORTD0 (coord A5), J2[6]/SPI0_PCS0/FTM3_CH0
  @{ */
#define ROTARY_ENCODER_BUTTON_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define ROTARY_ENCODER_BUTTON_PORT PORTD /*!<@brief PORT device name: PORTD */
#define ROTARY_ENCODER_BUTTON_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                         /* @} */

/*! @name PORTB18 (coord D12), J2[2]/FTM2_CH0
  @{ */
#define ROTARY_ENCODER_PHASE_A_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define ROTARY_ENCODER_PHASE_A_PORT PORTB /*!<@brief PORT device name: PORTB */
#define ROTARY_ENCODER_PHASE_A_PIN 18U    /*!<@brief PORTB pin index: 18 */
                                          /* @} */

/*! @name PORTB19 (coord D11), J2[4]/FTM2_CH1
  @{ */
#define ROTARY_ENCODER_PHASE_B_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define ROTARY_ENCODER_PHASE_B_PORT PORTB /*!<@brief PORT device name: PORTB */
#define ROTARY_ENCODER_PHASE_B_PIN 19U    /*!<@brief PORTB pin index: 19 */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ROTARY_ENCODER(void);

/*! @name PORTD5 (coord A3), J6[7]/SPI1_SCK/SCK
  @{ */
#define MAX7219_SCK_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MAX7219_SCK_PIN 5U     /*!<@brief PORTD pin index: 5 */
                               /* @} */

/*! @name PORTD6 (coord A2), J6[6]/SPI1_SOUT/MOSI
  @{ */
#define MAX7219_SOUT_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MAX7219_SOUT_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                /* @} */

/*! @name PORTD7 (coord A1), J6[7]/SPI1_SIN/MISO
  @{ */
#define MAX7219_SIN_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MAX7219_SIN_PIN 7U     /*!<@brief PORTD pin index: 7 */
                               /* @} */

/*! @name PORTD4 (coord A4), J6[4]/SPI1_PCS0/CS
  @{ */
#define MAX7219_PCS_PORT PORTD /*!<@brief PORT device name: PORTD */
#define MAX7219_PCS_PIN 4U     /*!<@brief PORTD pin index: 4 */
                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MAX7219(void);

/*! @name PORTD2 (coord C4), J2[8]/SPI0_SOUT/FB_AD4
  @{ */
#define GP_DEBUG_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define GP_DEBUG_PORT PORTD /*!<@brief PORT device name: PORTD */
#define GP_DEBUG_PIN 2U     /*!<@brief PORTD pin index: 2 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void GP(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
